In [ ]:
========================= EDA ==================

1) Pandas: Data frame applications

2) Numpy: Numerical python all math applications

3) Matplotlib: used for plotting

4) Seaborn: used for plot

5) Plotly: used for plot

6) Bokhe: plot

========= Machine learning ========

7) sickit-learn: sklearn

======= Deep learning=======

8) Tensorflow: Google

9) Keras: Google

10) Pytorch: Facebook

============== NLP========

11) NLTK : Natural language tool kit

12) SCipy

=============== BERT===========

13) Transformers: Hugging face (Google)

=========== Google models ==========

14) Specific google packages

======== Azure ML ==========
15) Azure packages

========= GenAI===============
16) Geminiai: Google

17) ChatGPT: OpneAI

================ LangChain============

18) Langchain packages

In [1]:
a=10
b=20
c=a+b
c

30

**Create a dataframe using list**

In [ ]:
- list === dictionary

- dictionary === list

$step-1$

**create a dataframe**

In [2]:
import pandas as pd
names=['Ayush','Avinash','Akash']
pd.DataFrame() # empty dataframe no rows and no columns

Empty DataFrame
Columns: []
Index: []

$step-2$

**provide the data**

In [3]:
names=['Ayush','Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [4]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age))
# what is the first positional argument: Data
# second positional argument: index

         0   1
0    Ayush  25
1  Avinash  30
2    Akash  35

In [5]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']
data=zip(names,age)
pd.DataFrame(data,city)

               0   1
hyd        Ayush  25
blr      Avinash  30
chennai    Akash  35

**step-3**
**Provide the column names**

In [6]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age),
             columns=['Names','Age'])

     Names  Age
0    Ayush   25
1  Avinash   30
2    Akash   35

In [9]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['Names','Age','City']
pd.DataFrame(data,columns=cols)

     Names  Age     City
0    Ayush   25      hyd
1  Avinash   30      blr
2    Akash   35  chennai

In [11]:
import pandas as pd
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,columns=cols)

In [12]:
type(df)

pandas.core.frame.DataFrame

**step-4**
**ADD new column**

- If you want to add new column
- First you need to check the number of rows in already existed data
- For example in above the dataframe has 3 rows
- you need to create a new list with 3 rows
- that list equate to the data frame

In [11]:
job=['DS','DE','CS']
df['JOB']=job
df

     Names  Age     City JOB
A    Ayush   25      hyd  DS
B  Avinash   30      blr  DE
C    Akash   35  chennai  CS

$step-5$

**Update the already existed column**

- Create new column and update new column both are same way

In [8]:
df['Age']=[35,40,45]
df

     Names  Age     City JOB
A    Ayush   35      hyd  DS
B  Avinash   40      blr  DE
C    Akash   45  chennai  CS

$step-6$

**Change the index**

In [14]:
import pandas as pd
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai

In [15]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

**Note**

- Number of list equals to **Number of columns**

- Number of values inside list equals to **Number of rows**

- When you create the data all the lists will be in same length

$step-7$

**shape**

- Number of rows
- Number of columns

In [18]:
df.shape
# Matrix format
# 4 rows and 3 columns
print("the number of rows are:",df.shape[0])
print("the number of columns are:",df.shape[1])

the number of rows are: 4
the number of columns are: 3

$step-8$

**Drop the column**

- In order to drop column we required 3 arguments**

- Column name

    - The column name we need to mention

- axis

    - axis=0 **represents rows**

    - axis=1 **represents columns**

- inplace

    - we are drop column means we are modifying the data frame

    - so this modifications we want to save in same variable or different variable

    - if you want to keep in the same variable then **inplace=True**

In [41]:
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [42]:
df.drop('City',axis=1,inplace=True)

In [43]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [44]:
df1=df.drop('Age',axis=1) # Do not give inplace to true

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [45]:
df # has two columns

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [46]:
df1

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [47]:
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [50]:
df.drop('City',axis=1,inplace=True)

In [51]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [52]:
df.drop('Age',axis=1)

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [53]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

$step-9$

**Multiple columns drop**

In [54]:
# again read the data
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [55]:
df.drop(['Age','City'],axis=1,inplace=True)

In [56]:
df

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

$Step-10$

**Drop the rows**

In [57]:
# again read the data
import pandas as pd
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','blr','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [59]:
df.drop('A',axis=0,inplace=True)

In [62]:
df

     Names  Age     City
B  Avinash   30      blr
C    Akash   35  chennai
D     Anvi   40   Mumbai

$step-11$

**How to save the data frame**

- Generally data frames are two types

-  CSV (comma seperated value)

-  excel

In [67]:
# file name=data
# extension=.CSV
df.to_csv('data.CSV')
df.to_csv('data1.CSV',index=False)

In [70]:
# Extension
# .xlsx
df.to_excel('data2.xlsx',index=False)